sunwise/gcc-stm32-osal/CarSrc/STM32_CUBEMX/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f0xx_hal.h"
#include "stm32f0xx_ll_usart.h"
#include "stm32f0xx_ll_rcc.h"
#include "stm32f0xx_ll_bus.h"
#include "stm32f0xx_ll_cortex.h"
#include "stm32f0xx_ll_system.h"
#include "stm32f0xx_ll_utils.h"
#include "stm32f0xx_ll_pwr.h"
#include "stm32f0xx_ll_gpio.h"
#include "stm32f0xx_ll_dma.h"

#include "stm32f0xx_ll_exti.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define MN5_Pin GPIO_PIN_0
#define MN5_GPIO_Port GPIOA
#define MN6_Pin GPIO_PIN_1
#define MN6_GPIO_Port GPIOA
#define POWER_HOLD_Pin GPIO_PIN_3
#define POWER_HOLD_GPIO_Port GPIOA
#define MN3_Pin GPIO_PIN_0
#define MN3_GPIO_Port GPIOB
#define MN4_Pin GPIO_PIN_1
#define MN4_GPIO_Port GPIOB
#define MN1_Pin GPIO_PIN_11
#define MN1_GPIO_Port GPIOA
#define MN2_Pin GPIO_PIN_12
#define MN2_GPIO_Port GPIOA
#define RF_CE_Pin GPIO_PIN_15
#define RF_CE_GPIO_Port GPIOA
#define RF_IRQ_Pin GPIO_PIN_3
#define RF_IRQ_GPIO_Port GPIOB
#define ZIGBEE_DEF_Pin GPIO_PIN_4
#define ZIGBEE_DEF_GPIO_Port GPIOB
#define ZIGBEE_RESET_Pin GPIO_PIN_5
#define ZIGBEE_RESET_GPIO_Port GPIOB
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
